# DesignOptionAndWorksetViolation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoJoinFailures..::..DesignOptionAndWorksetViolation Property
BuiltInFailures..::..AutoJoinFailures Class See Also
---
Can't make the expected join because of editability and design option restrictions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DesignOptionAndWorksetViolation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DesignOptionAndWorksetViolation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DesignOptionAndWorksetViolation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoJoinFailures Class
Autodesk.Revit.DB Namespace